# Advanced Networking Notes
###### September 5, 2022
---

**(Guest/ Limited Access)** User EXEC Commands. 
To access admin: 
```bash
    Router> enable or en
``````
To Access Only Config:
**(Admin/ Full Access)** Priveleged EXEC Commands.
```bash
    Router# configure terminal or conf t
```
**(Only Configure/ Full Access)** Global Config Commands.
```bash
    Router(config)#
```

---
###### Cisco Router Boot Process:
1. Power-on-self-test (POST).
1. Check Configuration Regsiter Setting.
1. Load IOS (Internetwork Operating System).
1. Load Startup Configuration

###### Default Register Setting
0x2102

---

Run this every time you finish or want to save the configuration:
```bash
    router# copy run startup-config
```

If you want to remove a configure:

```bash
    router# no "configuration name"
```
Example: 
```bash
    no hostname
```

Configure hostname:
```bash
    router# hostname "hostnamehere"
```

Put password in console:
```bash
    router# line console "port"
    router# password "passwordhere"
```

Put time-out:
```bash
    exec-timeout 2(m) 30(s)
```

Put password in AUX port:
```bash
    router# line aux "port"
    router# password "passwordhere"
    router# login
    router# logging synchronous
```

Configure Virtual Ports/ Terminal
```bash
    router# line vty "port"
```

Put password in Priveleged Mode:
```bash
    router# enable password "password
```

For wireshark not to see or not crackable:
```bash
    router# enable secret "different password"
```

Encrypt all password you set:
```bash
    router# service password-encryption
```


`