# Advanced Networking Notes
###### September 19, 2022
---
##### Change switch host name:
```
    switch(config)# hostname SW0
```

##### Put IP Addr. in Switch:
```
    SW0(config)# int vlan 1
    SW0(config)# ip address 192.168.1.2 255.255.255.0
    SW0(config)# no shutdown
```

---

##### Show CDP neighbors:
```
    router# show cdp neighbors
```
##### Show CDP neighbor in detail:
```
    router# show cdp neighbors detail
```

>CDP is Cisco Discovery Protocol. A proprietary protocol designed to facilitate the network management of Cisco devices by discovering hardware and protocol information about neighboring devices.