# Advanced Networking Notes
###### September 12, 2022

TELNET- Teletype Network (CLI), remote location, not secured (data is in plain text).

Router setup before using TELNET:
1. Router mush have an IP Address
1. Privelegeds mode password is enabled or secret password is enabled
1. Line vty 0 4 passwrod must be configured

Connect using TELNET to 192.168.1.1:
```
    PC> telnet 192.168.1.1
```
Connect using SSH to 192.168.1.1:
```
    PC> ssh -l kmvroxas 192.168.1.1
```

Show Log:
```
    PC> show users
```
---
SSH- Secure Shell, used to configure devices through a remote location, it was designed to replace TELNET.

Router configuration before using SSH:
1. Hostname used in not the default(Router).
1. Priveleged mode password is enabled or secret password.


Put a password when connecting using TELNET/SSH:
```
    (config)# username kmvroxas password 123456
    (config)# line vty 0 4
    (config-line)# login local
    (config-line)# transport input all
```
Create SSH:
```
    (config)# ip domain name INF201
    (config)# crypto key generate rsa 2048 
    >show ip ssh(to see if ssh is enabled)
```
> 2048 is bit in modulus

---
Allows both TELNET and SSH Connections:
```
    (config-line)# transport input all 
```
Allows both TELNET and SSH Connections:
```
    (config-line)# transport input telnet ssh
```
Allows TELNET only:
```
    (config-line)# transport input telnet
```
Allows SSH only:
```
    (config-line)# transport input SSH 
```
Allows none/ Block all connections:
```
    (config-line)# transport input none 
```

---

DHCP- Dynamic Host Configuration Protocol

Set-up DHCP:
```
    (config)# ip dhcp excluded-address 192.168.1.1 192.168.1.10 (reserve IP Address so DHCP will start at 192.168.1.11)
    (config)# ip dhcp pool roxaskmv (name your dhcp pool)
    (dhcp-config)# network 192.168.1.0(Network ID) 255.255.255.0
    (dhcp-config)# default-router 192.168.1.1(default gateway)
    (dhcp-config)# dns-server 192.168.1.1
```

Show IP Address assigned:
```
    router> show ip dhcp binding
```